In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

In [56]:
app = pd.read_csv('application_record.csv')
cred = pd.read_csv('credit_record.csv')

# Initial Exploration
## application_record.csv

In [57]:
# There are 438,557 rows, but occupation type has a considerable number of null values
app.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 438557 entries, 0 to 438556
Data columns (total 18 columns):
 #   Column               Non-Null Count   Dtype
---  ------               --------------   -----
 0   ID                   438557 non-null  int64
 1   CODE_GENDER          438557 non-null  object
 2   FLAG_OWN_CAR         438557 non-null  object
 3   FLAG_OWN_REALTY      438557 non-null  object
 4   CNT_CHILDREN         438557 non-null  int64
 5   AMT_INCOME_TOTAL     438557 non-null  float64
 6   NAME_INCOME_TYPE     438557 non-null  object
 7   NAME_EDUCATION_TYPE  438557 non-null  object
 8   NAME_FAMILY_STATUS   438557 non-null  object
 9   NAME_HOUSING_TYPE    438557 non-null  object
 10  DAYS_BIRTH           438557 non-null  int64
 11  DAYS_EMPLOYED        438557 non-null  int64
 12  FLAG_MOBIL           438557 non-null  int64
 13  FLAG_WORK_PHONE      438557 non-null  int64
 14  FLAG_PHONE           438557 non-null  int64
 15  FLAG_EMAIL           438557 non-null  int64
 16  OCCUPATION_TYPE      304354 non-null  object
 17  CNT_FAM_MEMBERS      438557 non-null  float64
dtypes: float64(2), int64(8), object(8)
memory usage: 60.2+ MB

In [58]:
app.head()

,ID,CODE_GENDER,FLAG_OWN_CAR,FLAG_OWN_REALTY,CNT_CHILDREN,AMT_INCOME_TOTAL,NAME_INCOME_TYPE,NAME_EDUCATION_TYPE,NAME_FAMILY_STATUS,NAME_HOUSING_TYPE,DAYS_BIRTH,DAYS_EMPLOYED,FLAG_MOBIL,FLAG_WORK_PHONE,FLAG_PHONE,FLAG_EMAIL,OCCUPATION_TYPE,CNT_FAM_MEMBERS
0,5008804,M,Y,Y,0,427500.0,Working,Higher education,Civil marriage,Rented apartment,-12005,-4542,1,1,0,0,NaN,2.0
1,5008805,M,Y,Y,0,427500.0,Working,Higher education,Civil marriage,Rented apartment,-12005,-4542,1,1,0,0,NaN,2.0
2,5008806,M,Y,Y,0,112500.0,Working,Secondary / secondary special,Married,House / apartment,-21474,-1134,1,0,0,0,Security staff,2.0
3,5008808,F,N,Y,0,270000.0,Commercial associate,Secondary / secondary special,Single / not married,House / apartment,-19110,-3051,1,0,1,1,Sales staff,1.0
4,5008809,F,N,Y,0,270000.0,Commercial associate,Secondary / secondary special,Single / not married,House / apartment,-19110,-3051,1,0,1,1,Sales staff,1.0

In [59]:
app.describe()

,ID,CNT_CHILDREN,AMT_INCOME_TOTAL,DAYS_BIRTH,DAYS_EMPLOYED,FLAG_MOBIL,FLAG_WORK_PHONE,FLAG_PHONE,FLAG_EMAIL,CNT_FAM_MEMBERS
count,4.385570e+05,438557.000000,4.385570e+05,438557.000000,438557.000000,438557.0,438557.000000,438557.000000,438557.000000,438557.000000
mean,6.022176e+06,0.427390,1.875243e+05,-15997.904649,60563.675328,1.0,0.206133,0.287771,0.108207,2.194465
std,5.716370e+05,0.724882,1.100869e+05,4185.030007,138767.799647,0.0,0.404527,0.452724,0.310642,0.897207
min,5.008804e+06,0.000000,2.610000e+04,-25201.000000,-17531.000000,1.0,0.000000,0.000000,0.000000,1.000000
25%,5.609375e+06,0.000000,1.215000e+05,-19483.000000,-3103.000000,1.0,0.000000,0.000000,0.000000,2.000000
50%,6.047745e+06,0.000000,1.607805e+05,-15630.000000,-1467.000000,1.0,0.000000,0.000000,0.000000,2.000000
75%,6.456971e+06,1.000000,2.250000e+05,-12514.000000,-371.000000,1.0,0.000000,1.000000,0.000000,3.000000
max,7.999952e+06,19.000000,6.750000e+06,-7489.000000,365243.000000,1.0,1.000000,1.000000,1.000000,20.000000

In [60]:
app['DAYS_EMPLOYED'] = app['DAYS_EMPLOYED'] * -1 # Converting length of time to a more intuitive format
app['DAYS_BIRTH'] = app['DAYS_BIRTH'] * -1 # Converting length of time to a more intuitive format
app['AGE_YEARS'] = round((app['DAYS_BIRTH'] / 365), 1) # Adding column representing years instead of days

In [61]:
app.head()

,ID,CODE_GENDER,FLAG_OWN_CAR,FLAG_OWN_REALTY,CNT_CHILDREN,AMT_INCOME_TOTAL,NAME_INCOME_TYPE,NAME_EDUCATION_TYPE,NAME_FAMILY_STATUS,NAME_HOUSING_TYPE,DAYS_BIRTH,DAYS_EMPLOYED,FLAG_MOBIL,FLAG_WORK_PHONE,FLAG_PHONE,FLAG_EMAIL,OCCUPATION_TYPE,CNT_FAM_MEMBERS,AGE_YEARS
0,5008804,M,Y,Y,0,427500.0,Working,Higher education,Civil marriage,Rented apartment,12005,4542,1,1,0,0,NaN,2.0,32.9
1,5008805,M,Y,Y,0,427500.0,Working,Higher education,Civil marriage,Rented apartment,12005,4542,1,1,0,0,NaN,2.0,32.9
2,5008806,M,Y,Y,0,112500.0,Working,Secondary / secondary special,Married,House / apartment,21474,1134,1,0,0,0,Security staff,2.0,58.8
3,5008808,F,N,Y,0,270000.0,Commercial associate,Secondary / secondary special,Single / not married,House / apartment,19110,3051,1,0,1,1,Sales staff,1.0,52.4
4,5008809,F,N,Y,0,270000.0,Commercial associate,Secondary / secondary special,Single / not married,House / apartment,19110,3051,1,0,1,1,Sales staff,1.0,52.4

In [62]:
app.shape

(438557, 19)

In [63]:
len(app.ID.unique()) # The number of unique ID's does not match the shape of the dataframe. Therefore there are duplicated IDs.

438510

In [64]:
app[app.duplicated('ID', keep=False)].sort_values(by='ID') # These ID's are duplicated, but they clearly are not the same person.

,ID,CODE_GENDER,FLAG_OWN_CAR,FLAG_OWN_REALTY,CNT_CHILDREN,AMT_INCOME_TOTAL,NAME_INCOME_TYPE,NAME_EDUCATION_TYPE,NAME_FAMILY_STATUS,NAME_HOUSING_TYPE,DAYS_BIRTH,DAYS_EMPLOYED,FLAG_MOBIL,FLAG_WORK_PHONE,FLAG_PHONE,FLAG_EMAIL,OCCUPATION_TYPE,CNT_FAM_MEMBERS,AGE_YEARS
426818,7022197,M,Y,Y,3,135000.0,Working,Secondary / secondary special,Married,House / apartment,11945,735,1,0,0,1,Laborers,5.0,32.7
425023,7022197,F,N,Y,0,450000.0,Commercial associate,Higher education,Separated,House / apartment,19813,1799,1,0,0,1,NaN,1.0,54.3
431545,7022327,F,N,Y,0,135000.0,Commercial associate,Secondary / secondary special,Single / not married,House / apartment,14771,5298,1,0,0,0,High skill tech staff,1.0,40.5
431911,7022327,M,Y,Y,0,256500.0,Commercial associate,Higher education,Married,House / apartment,21503,1674,1,0,0,1,Core staff,2.0,58.9
425486,7023108,M,Y,Y,1,67500.0,Working,Secondary / secondary special,Married,House / apartment,15156,1696,1,1,0,0,Core staff,3.0,41.5
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
426563,7836711,F,N,Y,2,292500.0,Working,Higher education,Married,House / apartment,13747,4386,1,0,1,0,Accountants,4.0,37.7
421464,7836971,M,Y,N,1,157500.0,Working,Secondary / secondary special,Married,House / apartment,13771,5520,1,0,0,0,NaN,3.0,37.7
428620,7836971,F,N,Y,0,103500.0,Working,Secondary / secondary special,Civil marriage,House / apartment,13383,2798,1,0,1,0,Sales staff,2.0,36.7
422068,7838075,M,N,Y,0,337500.0,Commercial associate,Secondary / secondary special,Married,House / apartment,18198,1275,1,0,0,1,Drivers,2.0,49.9
423702,7838075,F,Y,Y,0,315000.0,Commercial associate,Higher education,Single / not married,House / apartment,10698,1659,1,0,0,1,NaN,1.0,29.3

### Gender

In [65]:
app.CODE_GENDER.value_counts()

F    294440
M    144117
Name: CODE_GENDER, dtype: int64

### Car Ownership

In [66]:
app.FLAG_OWN_CAR.value_counts()

N    275459
Y    163098
Name: FLAG_OWN_CAR, dtype: int64

### Gender/Car Ownership Crosstab

In [67]:
pd.crosstab(app.CODE_GENDER, app.FLAG_OWN_CAR)

FLAG_OWN_CAR       N      Y
CODE_GENDER
F             219444  74996
M              56015  88102

### Own Realty

In [68]:
app.FLAG_OWN_REALTY.value_counts()

Y    304074
N    134483
Name: FLAG_OWN_REALTY, dtype: int64

### Children

In [69]:
app.CNT_CHILDREN.value_counts()

0     304071
1      88527
2      39884
3       5430
4        486
5        133
7          9
9          5
12         4
6          4
14         3
19         1
Name: CNT_CHILDREN, dtype: int64

In [70]:
app[app.CNT_CHILDREN > 10] # This has revealed that there are a number of applicants that have entered more than one application, resulting in multiple application IDs

,ID,CODE_GENDER,FLAG_OWN_CAR,FLAG_OWN_REALTY,CNT_CHILDREN,AMT_INCOME_TOTAL,NAME_INCOME_TYPE,NAME_EDUCATION_TYPE,NAME_FAMILY_STATUS,NAME_HOUSING_TYPE,DAYS_BIRTH,DAYS_EMPLOYED,FLAG_MOBIL,FLAG_WORK_PHONE,FLAG_PHONE,FLAG_EMAIL,OCCUPATION_TYPE,CNT_FAM_MEMBERS,AGE_YEARS
20441,5061207,M,Y,Y,14,225000.0,Working,Secondary / secondary special,Separated,House / apartment,17754,1689,1,0,0,0,Drivers,15.0,48.6
20442,5061210,M,Y,Y,14,225000.0,Working,Secondary / secondary special,Separated,House / apartment,17754,1689,1,0,0,0,Drivers,15.0,48.6
20443,5061211,M,Y,Y,14,225000.0,Working,Secondary / secondary special,Separated,House / apartment,17754,1689,1,0,0,0,Drivers,15.0,48.6
36388,5105054,F,N,Y,19,112500.0,Working,Secondary / secondary special,Single / not married,House / apartment,11057,1853,1,1,1,0,Waiters/barmen staff,20.0,30.3
208909,5931568,F,N,Y,12,337500.0,Commercial associate,Secondary / secondary special,Married,House / apartment,14093,2710,1,0,0,0,Core staff,14.0,38.6
208910,5931569,F,N,Y,12,337500.0,Commercial associate,Secondary / secondary special,Married,House / apartment,14093,2710,1,0,0,0,Core staff,14.0,38.6
208911,5931570,F,N,Y,12,337500.0,Commercial associate,Secondary / secondary special,Married,House / apartment,14093,2710,1,0,0,0,Core staff,14.0,38.6
208912,5931571,F,N,Y,12,337500.0,Commercial associate,Secondary / secondary special,Married,House / apartment,14093,2710,1,0,0,0,Core staff,14.0,38.6

In [71]:
app.CNT_CHILDREN.describe()

count    438557.000000
mean          0.427390
std           0.724882
min           0.000000
25%           0.000000
50%           0.000000
75%           1.000000
max          19.000000
Name: CNT_CHILDREN, dtype: float64

### Income Total

In [78]:
app.AMT_INCOME_TOTAL.describe().apply(lambda x: format(x, 'f'))

count     438557.000000
mean      187524.286010
std       110086.853066
min        26100.000000
25%       121500.000000
50%       160780.500000
75%       225000.000000
max      6750000.000000
Name: AMT_INCOME_TOTAL, dtype: object

### Income Type

In [79]:
app.NAME_INCOME_TYPE.value_counts()

Working                 226104
Commercial associate    100757
Pensioner                75493
State servant            36186
Student                     17
Name: NAME_INCOME_TYPE, dtype: int64

### Education Type

In [80]:
app.NAME_EDUCATION_TYPE.value_counts()

Secondary / secondary special    301821
Higher education                 117522
Incomplete higher                 14851
Lower secondary                    4051
Academic degree                     312
Name: NAME_EDUCATION_TYPE, dtype: int64

### Family Status

In [81]:
app.NAME_FAMILY_STATUS.value_counts()

Married                 299828
Single / not married     55271
Civil marriage           36532
Separated                27251
Widow                    19675
Name: NAME_FAMILY_STATUS, dtype: int64

### Housing Type

In [82]:
app.NAME_HOUSING_TYPE.value_counts()

House / apartment      393831
With parents            19077
Municipal apartment     14214
Rented apartment         5974
Office apartment         3922
Co-op apartment          1539
Name: NAME_HOUSING_TYPE, dtype: int64

### Age in Days/Years

In [83]:
app.DAYS_BIRTH.describe()

count    438557.000000
mean      15997.904649
std        4185.030007
min        7489.000000
25%       12514.000000
50%       15630.000000
75%       19483.000000
max       25201.000000
Name: DAYS_BIRTH, dtype: float64

In [84]:
app.AGE_YEARS.describe()

count    438557.000000
mean         43.830089
std          11.465683
min          20.500000
25%          34.300000
50%          42.800000
75%          53.400000
max          69.000000
Name: AGE_YEARS, dtype: float64

### Days Employed

In [85]:
app.DAYS_EMPLOYED.describe()

count    438557.000000
mean     -60563.675328
std      138767.799647
min     -365243.000000
25%         371.000000
50%        1467.000000
75%        3103.000000
max       17531.000000
Name: DAYS_EMPLOYED, dtype: float64

### Mobile Phone Ownership

In [86]:
app.FLAG_MOBIL.value_counts() # 100% of people own a mobile phone. Is this because the application is made through a mobile phone?

1    438557
Name: FLAG_MOBIL, dtype: int64

### Phone Ownership (Landline?)

In [88]:
app.FLAG_PHONE.value_counts()

0    312353
1    126204
Name: FLAG_PHONE, dtype: int64

In [91]:
app.FLAG_PHONE.mean()

0.28777103090362255

### Phone Ownership - Work Line

In [89]:
app.FLAG_WORK_PHONE.value_counts()

0    348156
1     90401
Name: FLAG_WORK_PHONE, dtype: int64

In [90]:
app.FLAG_WORK_PHONE.mean()

0.2061328402009317

### E-Mail Ownership

In [92]:
app.FLAG_EMAIL.value_counts()

0    391102
1     47455
Name: FLAG_EMAIL, dtype: int64

In [93]:
app.FLAG_EMAIL.mean()

0.10820714297115312

### Occupation Type

In [94]:
app.OCCUPATION_TYPE.value_counts()

Laborers                 78240
Core staff               43007
Sales staff              41098
Managers                 35487
Drivers                  26090
High skill tech staff    17289
Accountants              15985
Medicine staff           13520
Cooking staff             8076
Security staff            7993
Cleaning staff            5845
Private service staff     3456
Low-skill Laborers        2140
Secretaries               2044
Waiters/barmen staff      1665
Realty agents             1041
HR staff                   774
IT staff                   604
Name: OCCUPATION_TYPE, dtype: int64

In [104]:
app[app['OCCUPATION_TYPE'].isna()

,ID,CODE_GENDER,FLAG_OWN_CAR,FLAG_OWN_REALTY,CNT_CHILDREN,AMT_INCOME_TOTAL,NAME_INCOME_TYPE,NAME_EDUCATION_TYPE,NAME_FAMILY_STATUS,NAME_HOUSING_TYPE,DAYS_BIRTH,DAYS_EMPLOYED,FLAG_MOBIL,FLAG_WORK_PHONE,FLAG_PHONE,FLAG_EMAIL,OCCUPATION_TYPE,CNT_FAM_MEMBERS,AGE_YEARS
0,5008804,M,Y,Y,0,427500.0,Working,Higher education,Civil marriage,Rented apartment,12005,4542,1,1,0,0,NaN,2.0,32.9
1,5008805,M,Y,Y,0,427500.0,Working,Higher education,Civil marriage,Rented apartment,12005,4542,1,1,0,0,NaN,2.0,32.9
7,5008812,F,N,Y,0,283500.0,Pensioner,Higher education,Separated,House / apartment,22464,-365243,1,0,0,0,NaN,1.0,61.5
8,5008813,F,N,Y,0,283500.0,Pensioner,Higher education,Separated,House / apartment,22464,-365243,1,0,0,0,NaN,1.0,61.5
9,5008814,F,N,Y,0,283500.0,Pensioner,Higher education,Separated,House / apartment,22464,-365243,1,0,0,0,NaN,1.0,61.5
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
438549,6840098,F,N,Y,0,135000.0,Pensioner,Secondary / secondary special,Separated,House / apartment,22717,-365243,1,0,0,0,NaN,1.0,62.2
438550,6840100,F,N,Y,0,135000.0,Pensioner,Secondary / secondary special,Separated,House / apartment,22717,-365243,1,0,0,0,NaN,1.0,62.2
438551,6840102,F,N,Y,0,135000.0,Pensioner,Secondary / secondary special,Separated,House / apartment,22717,-365243,1,0,0,0,NaN,1.0,62.2
438552,6840104,M,N,Y,0,135000.0,Pensioner,Secondary / secondary special,Separated,House / apartment,22717,-365243,1,0,0,0,NaN,1.0,62.2
438555,6842765,F,N,Y,0,72000.0,Pensioner,Secondary / secondary special,Married,House / apartment,21673,-365243,1,0,0,0,NaN,2.0,59.4

In [111]:
app[app['OCCUPATION_TYPE'].isna()]['NAME_INCOME_TYPE'].value_counts()

Pensioner               75357
Working                 35886
Commercial associate    16745
State servant            6210
Student                     5
Name: NAME_INCOME_TYPE, dtype: int64

In [112]:
app[~app['OCCUPATION_TYPE'].isna()]['NAME_INCOME_TYPE'].value_counts()

Working                 190218
Commercial associate     84012
State servant            29976
Pensioner                  136
Student                     12
Name: NAME_INCOME_TYPE, dtype: int64

In [113]:
app[app.NAME_INCOME_TYPE == 'Pensioner']

,ID,CODE_GENDER,FLAG_OWN_CAR,FLAG_OWN_REALTY,CNT_CHILDREN,AMT_INCOME_TOTAL,NAME_INCOME_TYPE,NAME_EDUCATION_TYPE,NAME_FAMILY_STATUS,NAME_HOUSING_TYPE,DAYS_BIRTH,DAYS_EMPLOYED,FLAG_MOBIL,FLAG_WORK_PHONE,FLAG_PHONE,FLAG_EMAIL,OCCUPATION_TYPE,CNT_FAM_MEMBERS,AGE_YEARS
7,5008812,F,N,Y,0,283500.0,Pensioner,Higher education,Separated,House / apartment,22464,-365243,1,0,0,0,NaN,1.0,61.5
8,5008813,F,N,Y,0,283500.0,Pensioner,Higher education,Separated,House / apartment,22464,-365243,1,0,0,0,NaN,1.0,61.5
9,5008814,F,N,Y,0,283500.0,Pensioner,Higher education,Separated,House / apartment,22464,-365243,1,0,0,0,NaN,1.0,61.5
76,5008884,F,N,Y,0,315000.0,Pensioner,Secondary / secondary special,Widow,House / apartment,20186,-365243,1,0,0,0,NaN,1.0,55.3
160,5008974,F,N,Y,0,112500.0,Pensioner,Secondary / secondary special,Married,House / apartment,22319,-365243,1,0,0,0,NaN,2.0,61.1
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
438549,6840098,F,N,Y,0,135000.0,Pensioner,Secondary / secondary special,Separated,House / apartment,22717,-365243,1,0,0,0,NaN,1.0,62.2
438550,6840100,F,N,Y,0,135000.0,Pensioner,Secondary / secondary special,Separated,House / apartment,22717,-365243,1,0,0,0,NaN,1.0,62.2
438551,6840102,F,N,Y,0,135000.0,Pensioner,Secondary / secondary special,Separated,House / apartment,22717,-365243,1,0,0,0,NaN,1.0,62.2
438552,6840104,M,N,Y,0,135000.0,Pensioner,Secondary / secondary special,Separated,House / apartment,22717,-365243,1,0,0,0,NaN,1.0,62.2
438555,6842765,F,N,Y,0,72000.0,Pensioner,Secondary / secondary special,Married,House / apartment,21673,-365243,1,0,0,0,NaN,2.0,59.4

In [130]:
with pd.option_context('display.max_rows', None, 'display.max_columns', None):  # more options can be specified also
    print(app.groupby('OCCUPATION_TYPE').NAME_INCOME_TYPE.value_counts())

OCCUPATION_TYPE        NAME_INCOME_TYPE
Accountants            Working                  8567
                       Commercial associate     6203
                       State servant            1210
                       Pensioner                   5
Cleaning staff         Working                  4333
                       Commercial associate     1174
                       State servant             338
Cooking staff          Working                  5581
                       Commercial associate     1846
                       State servant             644
                       Pensioner                   5
Core staff             Working                 21514
                       State servant           11998
                       Commercial associate     9453
                       Pensioner                  33
                       Student                     9
Drivers                Working                 17793
                       Commercial associate     6717
                       State servant            1569
                       Pensioner                  11
HR staff               Working                   415
                       Commercial associate      256
                       State servant             103
High skill tech staff  Working                 10367
                       Commercial associate     4943
                       State servant            1971
                       Pensioner                   8
IT staff               Working                   309
                       Commercial associate      193
                       State servant             102
Laborers               Working                 57050
                       Commercial associate    18359
                       State servant            2797
                       Pensioner                  31
                       Student                     3
Low-skill Laborers     Working                  1782
                       Commercial associate      336
                       State servant              21
                       Pensioner                   1
Managers               Working                 17433
                       Commercial associate    14420
                       State servant            3615
                       Pensioner                  19
Medicine staff         Working                  7588
                       State servant            4213
                       Commercial associate     1709
                       Pensioner                  10
Private service staff  Working                  2055
                       Commercial associate     1347
                       State servant              54
Realty agents          Working                   539
                       Commercial associate      484
                       State servant              18
Sales staff            Working                 27000
                       Commercial associate    13870
                       State servant             219
                       Pensioner                   9
Secretaries            Working                  1157
                       Commercial associate      497
                       State servant             388
                       Pensioner                   2
Security staff         Working                  5690
                       Commercial associate     1685
                       State servant             616
                       Pensioner                   2
Waiters/barmen staff   Working                  1045
                       Commercial associate      520
                       State servant             100
Name: NAME_INCOME_TYPE, dtype: int64

### Count Family Members

In [96]:
app.CNT_FAM_MEMBERS.describe()

count    438557.000000
mean          2.194465
std           0.897207
min           1.000000
25%           2.000000
50%           2.000000
75%           3.000000
max          20.000000
Name: CNT_FAM_MEMBERS, dtype: float64

## credit_record.csv

In [6]:
cred.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1048575 entries, 0 to 1048574
Data columns (total 3 columns):
 #   Column          Non-Null Count    Dtype
---  ------          --------------    -----
 0   ID              1048575 non-null  int64
 1   MONTHS_BALANCE  1048575 non-null  int64
 2   STATUS          1048575 non-null  object
dtypes: int64(2), object(1)
memory usage: 24.0+ MB

In [97]:
cred.head()

        ID  MONTHS_BALANCE STATUS
0  5001711               0      X
1  5001711              -1      0
2  5001711              -2      0
3  5001711              -3      0
4  5001712               0      C

In [99]:
cred.MONTHS_BALANCE.describe().apply(lambda x: format(x, 'f'))

count    1048575.000000
mean         -19.136998
std           14.023498
min          -60.000000
25%          -29.000000
50%          -17.000000
75%           -7.000000
max            0.000000
Name: MONTHS_BALANCE, dtype: object

In [98]:
cred.STATUS.value_counts()

C    442031
0    383120
X    209230
1     11090
5      1693
2       868
3       320
4       223
Name: STATUS, dtype: int64

0: 1-29 days past due  
1: 30-59 days past due  
2: 60-89 days overdue  
3: 90-119 days overdue  
4: 120-149 days overdue  
5: Overdue or bad debts, write-offs for more than 150 days  

C: paid off that month  
X: No loan for the month

In [101]:
cred.shape

(1048575, 3)